#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.blog.acme_certificate.certificate[0] will be created
  + resource "acme_certificate" "certificate" {
      + account_key_pem    = (sensitive value)
      + certificate_domain = (known after apply)
      + certificate_p12    = (sensitive value)
      + certificate_pem    = (known after apply)
      + certificate_url    = (known after apply)
      + common_name        = "dev.mattwhite.blog"
      + id                 = (known after apply)
      + issuer_pem         = (known after apply)
      + key_type           = "4096"
      + min_days_remaining = 30
      + must_staple        = false
      + private_key_pem    = (sensitive value)

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "azure"
        }
    }

  # module.blog.azurerm_key_vault_certificate.le[0] will be created
  + resource "azurerm_key_vault_certificate" "le" {
      + certificate_data = (known after apply)
      + id               = (known after apply)
      + key_vault_id     = "/subscriptions/814a2d9d-752d-4ecb-bb2a-fc0321152d4b/resourceGroups/blog-dev/providers/Microsoft.KeyVault/vaults/kv245b8f88d462"
      + name             = "dev-mattwhite-blog"
      + secret_id        = (known after apply)
      + tags             = (known after apply)
      + thumbprint       = (known after apply)
      + vault_uri        = (known after apply)
      + version          = (known after apply)

      + certificate {
          + contents = (sensitive value)
        }

      + certificate_policy {
          + issuer_parameters {
              + name = "C=US, O=Let's Encrypt, CN=Let's Encrypt Authority X3"
            }

          + key_properties {
              + exportable = true
              + key_size   = 4096
              + key_type   = "RSA"
              + reuse_key  = false
            }

          + secret_properties {
              + content_type = "application/x-pkcs12"
            }

          + x509_certificate_properties {
              + extended_key_usage = (known after apply)
              + key_usage          = (known after apply)
              + subject            = (known after apply)
              + validity_in_months = (known after apply)

              + subject_alternative_names {
                  + dns_names = (known after apply)
                  + emails    = (known after apply)
                  + upns      = (known after apply)
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform CICD`, Action: `hashicorpterraform-github-actions4`, Working Directory: `terraform/tf`*
